francoolmedo/MixOil/dspic33_software/inicio(v4).X/configuraciones.c
#include "p33Fxxxx.h"
#include <xc.h>
#include <stdint.h>            //Includes uint16_t definition                    
#include <stdbool.h>           //Includes true/false definition          
#include <stdio.h>
#include "configuraciones.h"
#include "constantes.h"

/*
_FOSC(FCKSM_CSECMD) //Clock switching is enabled, Fail-Safe Clock Monitor is disabled     
_FOSCSEL(FNOSC_FRC & IESO_ON) //Internal Fast RC (FRC) y  Start up with FRC, then switch
 */

//----------------------------------------------------------------------------//
//                          CONFIGURACION BITS                                //
//----------------------------------------------------------------------------//


// FBS

#pragma config BWRP = WRPROTECT_OFF     // Boot Segment Write Protect (Boot Segment may be written)
#pragma config BSS = NO_FLASH           // Boot Segment Program Flash Code Protection (No Boot program Flash segment)
#pragma config RBS = NO_RAM             // Boot Segment RAM Protection (No Boot RAM)

// FSS
#pragma config SWRP = WRPROTECT_OFF     // Secure Segment Program Write Protect (Secure Segment may be written)
#pragma config SSS = NO_FLASH           // Secure Segment Program Flash Code Protection (No Secure Segment)
#pragma config RSS = NO_RAM             // Secure Segment Data RAM Protection (No Secure RAM)

// FGS
#pragma config GSS = OFF                // General Segment Code Protection (User program memory is not code-protected)
#pragma config GWRP = OFF               // General Code Segment Write Protect (User program memory is not write-protected)

// FOSCSEL
#pragma config FNOSC = FRC              // Oscillator Mode (Internal Fast RC (FRC))
#pragma config IESO = ON                // Two-speed Oscillator Start-Up Enable (Start up with FRC, then switch)

// FOSC
#pragma config POSCMD = NONE            // Primary Oscillator Source (Primary Oscillator Disabled)
#pragma config OSCIOFNC = ON            // OSC2 Pin Function (OSC2 pin has digital I/O function)
#pragma config FCKSM = CSECMD           // Clock Switching and Monitor (Clock switching is enabled, Fail-Safe Clock Monitor is disabled)

// FWDT
#pragma config WDTPOST = PS32768        // Watchdog Timer Postscaler (1:32,768)
#pragma config WDTPRE = PR128           // WDT Prescaler (1:128)
#pragma config WINDIS = OFF             // Watchdog Timer Window (Watchdog Timer in Non-Window mode)
#pragma config FWDTEN = OFF             // Watchdog Timer Enable (Watchdog timer enabled/disabled by user software)


// FPOR
#pragma config FPWRT = PWR128           // POR Timer Value (128ms)
#pragma config LPOL = ON                // Low-side PWM Output Polarity (Active High)
#pragma config HPOL = ON                // Motor Control PWM High Side Polarity bit (PWM module high side output pins have active-high output polarity)
#pragma config PWMPIN = ON              // Motor Control PWM Module Pin Mode bit (PWM module pins controlled by PORT register at device Reset)

// FICD
#pragma config ICS = PGD1               // Comm Channel Select (Communicate on PGC1/EMUC1 and PGD1/EMUD1)
#pragma config JTAGEN = OFF             // JTAG Port Enable (JTAG is Disabled)

//-------------------------  Fin Configuracion BITS  -------------------------//

//----------------------------------------------------------------------------//
//                              Configura I/O                                 //
//----------------------------------------------------------------------------//

//extern char dato_Rx[TAM_Rx];

void configurarEntradasSalidas(void) {
    //Definicion de entradas y salidas
    //*********************  P U E R T O   A  **************************************
    //Entrada = 1, Salida = 0:                 
    TRISA = 0xFF3E; // TRIS_A = 1111  1111  0011  1110

    //*********************  P U E R T O   B  **************************************
    TRISB = 0xFFF8; //Entrada = 1, Salida = 0: TRIS_B = 1111 1111 1111 1000
    /*
        //  Habilitacion pull-up PORTB
        CNPU1 = 0x0000;
        CNPU2 = 0x0000;
  
     */
    //*********************  P U E R T O   C  **************************************    
    TRISC = 0xFFFF; //Entrada = 1, Salida = 0: TRIS_C = 0000 0000 0001 1110

    //*********************  P U E R T O   D  **************************************
    TRISD = 0x0FFF; //Entrada = 1, Salida = 0: TRIS_D = 0000 1111 1111 1111

    //*********************  P U E R T O   E  **************************************
    //**** Configuracion - NORMAL -                                   
    TRISE = 0xFFFF; //Entrada = 1, Salida = 0: TRIS_E = 1111 1111 1111 1111

    //***** Configuracion con - PWM -
    //    TRISE = 0x03F0;		//Entrada = 1, Salida = 0: TRIS_E = 0000 0011 1111 0000

    //*********************  P U E R T O   F  **************************************    
    //  TRISF = 0x0080;		//Entrada = 1, Salida = 0:     TRIS_F = 0000 0000 1000 0000
    //                                                                      | || MASTER SPI
    //    TRISF = 0x00CF;		//Entrada = 1, Salida = 0:     TRIS_F = 0000 0000 1100 0000
    //                                                                      | || SLAVE SPI    

    TRISF = 0xCFCC; //Entrada = 1, Salida = 0:     TRIS_F = 1100 1111 1100 1100

    //*********************  P U E R T O   G  **************************************    
    TRISG = 0x0C30; //Entrada = 1, Salida = 0: TRIS_G = 0000 1100 0011 0000

    //Entradas analogicas desactivadas
    AD1PCFGL = 0xFFFF;
    AD1PCFGH = 0xFFFF;
    AD2PCFGL = 0xFFFF;

    return;
}
//----------------------------  FIN Configura I/O  ---------------------------//

//----------------------------------------------------------------------------//
//                       W A T C H D O G   -   P L L                          //
//----------------------------------------------------------------------------//
//-------------  Deshabilita watchdog

void WDT_disable() {
    RCONbits.SWDTEN = 0; /* Disable Watch Dog Timer*/
}

//-------------  Deshabilita watchdog, configura PLL

