francoolmedo/MixOil/dspic33_software/inicio(v4).X/configuraciones.c
void configurarSistema() {
    WDT_disable();
    configurarPLL();
    configurarEntradasSalidas();
}

//-------------  Configura PLL

void configurarPLL(void) {
    PLLFBD = PLLFBD_M; // M = PLLFBD_ + 2 = 47
    CLKDIVbits.PLLPOST = PLLPOST_N1; // N1 = PLLPOST_N1 + 2 = 2
    CLKDIVbits.PLLPRE = PLLPRE_N2; // N2 = PLLPRE_N2 + 2 = 2

    __builtin_write_OSCCONH(0x01);
    __builtin_write_OSCCONL(0x01);
    //Espera que el cambio de reloj ocurra
    while (OSCCONbits.COSC != 0b001);
    //Espera que se estabilice el PLL
    while (OSCCONbits.LOCK != 1) {
    };

}
//------------------------  Fin Watchdoy y PLL  ------------------------------//


//----------------------------------------------------------------------------//
//               Inicializa PRIORIDAD DE INTERRUPCIONES                       // 
//----------------------------------------------------------------------------// 

void inicializaPrioridadInterrupciones(void) {
    /*  
        INTERRUPT PRIORITY CONTROL LEVEL
            111 = Interrupt is priority 7 (highest priority interrupt)
            110 = Interrupt is priority 6
            101 = Interrupt is priority 5
            100 = Interrupt is priority 4
            011 = Interrupt is priority 3
            010 = Interrupt is priority 2
            001 = Interrupt is priority 1 (lowest priority interrupt)
            000 = Interrupt is priority 0 (Interrupt source is disabled)
     */
    //TIMER 1
    IPC0bits.T1IP = 0; //Timer1 Interrupt priority level

    //UART
    IPC2bits.U1RXIP = 4; //UART Interrupt priority level

    //TIMER 2
    IPC1bits.T2IP = 6; //TIMER 2 Interrupt priority level

    //DMA
    IPC1bits.DMA0IP = 5; // Configura prioridad 5 para DMA0
    IPC3bits.DMA1IP = 3; // Configura prioridad 3 para DMA1

    //QEI
    IPC14bits.QEIIP = 0; //QEI Interrupt Priority bits

    //INT3
    IPC13bits.INT3IP = 0; //INT3 Interrupt Priority bits

    //INT4
    IPC13bits.INT4IP = 0; //INT4 Interrupt Priority bits

    //SPI
    IPC2bits.SPI1IP = 0; //SPI Interrupt Priority bits
}
//--------------  Fin Inicializacion Prioridad de Interrupciones  ------------//    


//----------------------------------------------------------------------------//
//                           Inicializa ADC                                   // 
//----------------------------------------------------------------------------// 

void inicializaADC(void) {
    /*
     AD1CON1=0x0000;
     AD1PCFGH = 0xFFF0;          //RC1=AN16(6)/RC2=AN17(7)/RC3=AN18(8)/RC4=AN19(9))
     AD1CON1bits.AD12B =1;      //MODO 12 bits
     AD1CON1bits.SIMSAM = 0;     //Muestro multicanal individualmente
     AD1CON1bits.ASAM = 0;       //Muestreo comienza con SAMP = 1
     AD1CON1bits.SSRC = 0;       //Termina el muestreo e inicia la conversion
     
     AD1CHS0=0x0010;            
     AD1CSSL=0;
     */
    //AD1CON2bits.CHPS =          //Select chanel utilized bits
    /*
   AD1CON2bits.VCFG = 0;       //+Vref=AVdd  -Vref=AVss
   AD1CON2bits.CSCNA = 0;      //Muestreo secuencial deshabilitado
   AD1CON2bits.BUFM = 0;       //Buffer fill mode
   AD1CON2bits.SMPI = 0;       //Despues de la conversion se genera la interrupcion
   AD1CON2bits.ALTS = 0;       //
     */
    /*
        AD1CON3bits.ADCS = 10;      //Conversion Clock
        AD1CON3bits.ADRC = 0;       //Clock ADC tomado del sistema
        AD1CON3=0x0002;            //TAD=INTERNAL 2*Tcy
        AD1CON2=0;
     */
    // AD1CHS0bits.CH0NB = 0;      //
    //AD1CSSHbits.CSS16 = 0;
    /* AD1PCFGL = 0xFFFF;          //TODAS DIGITAL
     AD2PCFGL = 0xFFFF;          //TODAS DIGITAL  
     AD1CON1bits.ADON = 1;       //Habilita ADC
     */
    /* ADC 10 BITS CHO + CHO -VREF */

    AD1CON1 = 0x0000;
    AD1PCFGH = 0xFFF0; //RC1=AN16(6)/RC2=AN17(7)/RC3=AN18(8)/RC4=AN19(9))
    AD1CHS0 = 0x0010;
    AD1CSSL = 0;
    AD1CON3 = 0x0002; //TAD=INTERNAL 2*Tcy
    AD1CON2 = 0;
    AD1CON1bits.ADON = 1; //Habilita ADC
}
//---------------------------  Fin Inicializa ADC  ---------------------------//


//----------------------------------------------------------------------------//
//                              Inicializa UART                               // 
//----------------------------------------------------------------------------//

void inicializaUART(int BAUDIOS) {

    U1MODEbits.UARTEN = 0; // Desactivar UART antes de configurar
    U1MODEbits.STSEL = 0; // 1-stop bit
    U1MODEbits.PDSEL = 0; // No Parity, 8-data bits
    U1MODEbits.ABAUD = 0; // Autobaud Disabled
    U1BRG = BAUDIOS; // Configuración de la velocidad en baudios

    U1STAbits.UTXISEL0 = 0; // Interrupción en cada carácter transmitido
    U1STAbits.UTXISEL1 = 0;
    U1STAbits.URXISEL = 0b10; // Interrupción cuando el FIFO RX está lleno

    IEC0bits.U1RXIE = 1; // Habilita la interrupción de RX
    IFS0bits.U1RXIF = 0; // Reinicia la bandera de interrupción de RX

    U1STAbits.UTXEN = 1; // Habilita UART Tx
    U1MODEbits.UARTEN = 1; // Habilita UART
}
//-----------------------  Fin inicializa UART  ------------------------------//


//----------------------------------------------------------------------------//
//                              Inicializa DMA 
// 
//----------------------------------------------------------------------------//

void inicializaDMA_TX() {
    extern unsigned int BufferA[TAM_DMA] __attribute__((space(dma)));

    DMA0CON = 0x2001; // One-Shot, Post-Increment, RAM-to-Peripheral
    DMA0CNT = TAM_DMA - 1; // Tamaño del buffer
    DMA0REQ = 0x001F; // UART1 TX
    DMA0PAD = (volatile unsigned int) &U1TXREG;
    DMA0STA = __builtin_dmaoffset(BufferA);

    IFS0bits.DMA0IF = 0;
    IEC0bits.DMA0IE = 1; // Interrupción de DMA habilitada
    DMA0CONbits.CHEN = 1; // Habilita el canal DMA1
}

void inicializaDMA_RX() {
    extern unsigned int BufferB[TAM_DMA] __attribute__((space(dma)));

    DMA1CON = 0x0000; // RAM-to-RAM, Post-Increment
    DMA1CNT = TAM_DMA - 1; // Tamaño del buffer
    DMA1REQ = 0x001E; // UART1 RX
    DMA1PAD = (volatile unsigned int) &U1RXREG;
    DMA1STA = __builtin_dmaoffset(BufferB);

    IFS0bits.DMA1IF = 0;
    IEC0bits.DMA1IE = 1; // Interrupción de DMA habilitada
    DMA1CONbits.CHEN = 1; // Habilita el canal DMA1
}
//-----------------------  Fin inicializa DMA  ------------------------------//

extern volatile int found;
extern unsigned int RX_CHEKA;
extern unsigned int BufferB[TAM_DMA] __attribute__((space(dma)));

void procesar_mensaje(void) {
    if (found) {
        found = 0; // Resetea la bandera
        int i = 2; // Inicia desde el tercer byte

        // Busca el final del mensaje para extraer el checksum
        while (i < TAM_DMA && BufferB[i] != '\n') {
            i++;
        }

        // Si llegamos al final del buffer sin encontrar '\n', no procesamos más
        if (i < TAM_DMA) {
            // i ahora apunta a la posición de '\n', entonces el checksum está en (i-3) y (i-2)
            if (i >= 3 && BufferB[i - 3] == '0' && BufferB[i - 2] == 'x') {
                unsigned char hex1 = BufferB[i - 1];
                unsigned char hex2 = BufferB[i - 2];

                // Convertimos los caracteres hexadecimales a un valor
                unsigned char value1 = (hex1 >= '0' && hex1 <= '9') ? hex1 - '0' : (hex1 >= 'A' && hex1 <= 'F') ? hex1 - 'A' + 10 : hex1 - 'a' + 10;
                unsigned char value2 = (hex2 >= '0' && hex2 <= '9') ? hex2 - '0' : (hex2 >= 'A' && hex2 <= 'F') ? hex2 - 'A' + 10 : hex2 - 'a' + 10;

                RX_CHEKA = (value2 << 4) | value1; // Combina los dos valores
            }
        }
    }
}


//-----------------------  Fin interrupcion DMA  ------------------------------//





//----------------------------------------------------------------------------//
//                        Inicializa SPI MASTER                               // 
//----------------------------------------------------------------------------//
/*
 void inicializaSPI_MASTER(void){
//Interrupt Controller Settings
    IFS0bits.SPI1IF = 0;        // Clear the Interrupt flag
    IEC0bits.SPI1IE = 0;        // Disable the interrupt
//SPI1CON1 Register Settings
    SPI1CON1bits.DISSCK = 0;    // Internal serial clock is enabled
    SPI1CON1bits.DISSDO = 0;    // SDOx pin is controlled by the module
    SPI1CON1bits.MODE16 = 0;    // Communication is word-wide (1=16 bits - 0=8 bits)
    SPI1CON1bits.SSEN = 0;      // 0 = No CS
    SPI1CON1bits.MSTEN = 1;     // Master mode enabled (1=MASTER)
    SPI1CON1bits.SMP = 0;       // Input data is sampled at the middle of data output time
    SPI1CON1bits.CKE = 0;       // Serial output data changes on transition from Idle clock state to active clock state
    SPI1CON1bits.CKP = 0;       // Idle state for clock is a low level active state is a high level
    SPI1CON1bits.SPRE = 5;      // Frecuencia de clock
    SPI1CON1bits.PPRE = 1;      // 909 Khz
//SPI1STAT Register Settings    
    SPI1STATbits.SPIEN = 1;     // Enable SPI module
    SPI1STATbits.SPIROV = 0;
    SPI1STATbits.SPISIDL = 1;
//IPC2 prioridad interrupciones    
    //IPC2bits.PSPI1IP = 5;       // INTERRUPT PRIORITY CONTROL REGISTER
//Interrupt Controller Settings
    IFS0bits.SPI1IF = 0;        // Clear the Interrupt flag
    IEC0bits.SPI1IE = 1;        // Enable the interrupt
  
