francoolmedo/MixOil/dspic33_software/inicio(v4).X/configuraciones.c
}
 
  
 */
//---------------------  Fin inicializa SPI MASTER  --------------------------//    


//----------------------------------------------------------------------------//
//                         Inicializa SPI SLAVE                               // 
//
/*
To set up the SPI module for the Slave mode of operation:
1. Clear the SPIxBUF register.
2. If using interrupts:
    a) Clear the SPIxIF bit in the respective IFSn register.
    b) Set the SPIxIE bit in the respective IECn register.
    c) Write the SPIxIP bits in the respective IPCn register to set the interrupt priority.
3. Write the desired settings to the SPIxCON1 and SPIxCON2 registers with MSTEN (SPIxCON1<5>) = 0.
4. Clear the SMP bit.
5. If the CKE bit is set, then the SSEN bit (SPIxCON1<7>) must be set to enable the SSx pin.
6. Clear the SPIROV bit (SPIxSTAT<6>).
7. Enable SPI operation by setting the SPIEN bit (SPIxSTAT<15>).
 */

/*
void inicializaSPI_SLAVE(void){
    SPI1BUF = 0;
    IFS0bits.SPI1IF = 0;        // Clear the Interrupt flag
    IEC0bits.SPI1IE = 0;        // Disable the interrupt
    // SPI1CON1 Register Settings
    SPI1CON1bits.DISSCK = 0;    // Internal Serial Clock is enabled
    SPI1CON1bits.DISSDO = 0;    // SDOx pin is controlled by the module
    SPI1CON1bits.MODE16 = 0;    // Communication is word-wide (1=16 bits - 0=8 bits)
    SPI1CON1bits.SSEN = 0;      // 0 = No CS
    SPI1CON1bits.SMP = 0;       // Input data is sampled at the middle of data 
                                // output time.
    SPI1CON1bits.CKE = 1;       // Serial output data changes on transition 
                                // from Idle clock state to active clock state
    SPI1CON1bits.CKP = 0;       // Idle state for clock is a low level; active 
                                // state is a high level
    SPI1CON1bits.MSTEN = 0;     // Master mode disabled (0=SLAVE)
    SPI1STATbits.SPIROV=0;      // No Receive Overflow has occurred
    SPI1STATbits.SPIEN = 1;     // Enable SPI module
    //IPC2 prioridad interrupciones    
    //IPC2bits.PSPI1IP = 5;       // INTERRUPT PRIORITY CONTROL REGISTER
    // Interrupt Controller Settings
    IFS0bits.SPI1IF = 0;        // Clear the Interrupt flag
    IEC0bits.SPI1IE = 1;        // Enable the interrupt
} 
 
 */
//----------------------  Fin inicializa SPI SLAVE  --------------------------//

//----------------------------------------------------------------------------//
//                           Transmite por SPI                                // 
//----------------------------------------------------------------------------//
/*
void write_SPI(char Dato_TX){
//void write_SPI(unsigned int Dato_TX){    
        
        SPI1BUF;                        //Clear register
        SPI1BUF = Dato_TX;              //Transfer data
        while(SPI1STATbits.SPITBF){}    //Wait for operation to complete    
    }
 */
//----------------------------------------------------------------------------//
//                       Recibe/Transmite por SPI                             // 
//----------------------------------------------------------------------------//
//void _ISRFAST _SPI1Interrupt(void)
//void _ISR _SPI1Interrupt(void){
/*
    unsigned int index = 0;
    //unsigned int spi[20] = {0};
    char spi[20] = {0};
    //bool recibio = 0;
    extern unsigned char wSPI[20];
    
void __attribute__((interrupt,no_auto_psv)) _ISR _SPI1Interrupt(void){
    //unsigned int buffer;
    // BUG WORKAROUND: If SSx is active, then proceed -- otherwise, disregard, reset, and return
    //if (PORTBbits.RB2 == 1) {
        IFS0bits.SPI1IF = 0;            //Clear the interrupt flag
        //IEC0bits.SPI1IE = 0;            //Disable Interrupt
        SPI1STATbits.SPIROV = 0;        //Clear any errors
        //buffer = SPI1BUF;               //Read in SPI1 buffer
       
        if(index <= 3){    

            spi[index] = SPI1BUF;
            
            SPI1BUF = 0;
            SPI1BUF = wSPI[index];              //Transfer data
            while(SPI1STATbits.SPITBF){}    //Wait for operation to complete  
            index++;
        }
        if(index >= 4){
            index = 0;
        }
    return;
    //}
}
 */

//----------------------------------------------------------------------------//
//                           Inicializa QEI                                   // 
//----------------------------------------------------------------------------//
/*
void inicializaQEI(void){
    QEICONbits.QEIM = 0;
    QEICONbits.CNTERR = 0;    // Clear any count errors
    QEICONbits.QEISIDL = 0;   // Continue operation during sleep
    QEICONbits.SWPAB = 0;     // QEA and QEB not swapped
    QEICONbits.PCDOUT = 0;    // Normal I/O pin operation
    QEICONbits.POSRES = 0;    // Index pulse resets position counter
    DFLTCONbits.CEID = 1;     // Count error interrupts disabled
    DFLTCONbits.QEOUT = 1;    // Digital filters output enabled for QEn pins
    DFLTCONbits.QECK = 5;     // 1:64 clock divide for digital filter for QEn
    
    POSCNT = 0;               // Reset position counter
    MAXCNT = 0xFFFF;
    QEICONbits.QEIM0 = 1;      // X4 mode with position counter reset by Index
    QEICONbits.QEIM1 = 1;      // X4 mode with position counter reset by Index
    QEICONbits.QEIM2 = 1;      // X4 mode with position counter reset by Index
        
    //IPC14bits.QEIIP  = 6;               //QEI Interrupt Priority bits - 0=deshabilitada 7=max prioridad
    //IPC14bits.QEIIP0 = 1;             //QEI Interrupt Priority bits
    //IPC14bits.QEIIP1 = 1;             //QEI Interrupt Priority bits
    //IPC14bits.QEIIP2 = 1;             //QEI Interrupt Priority bits
    IEC3bits.QEIIE   = 1;               //QEI Event Interrupt Enable bit
    IFS3bits.QEIIF   = 0;               //QEI Interrupt Flag Enable bit
}
 
 */
//------------------------  Fin inicializa QEI  ------------------------------//

//----------------------------------------------------------------------------//
//                              Inicializa INT3                               // 
//----------------------------------------------------------------------------//
//  RA14 - pin 66

