francoolmedo/MixOil/dspic33_software/inicio(v4).X/configuraciones.c
/*
void inicializaINT3(void){
    INTCON2bits.INT3EP = 0;     //Polaridad del flanco - 1-Negativo/0-Positivo
    IEC3bits.INT3IE = 0;        //Interrupcion Habilitada - 1-Habilitada
    //IPC13bits.INT3IP = 7;       //Prioridad - 7-Alta/0-Baja
    IFS3bits.INT3IF = 0;        //Clear INT3 Interrupt Flag
}
 
 */
//------------------------  Fin inicializa INT3  -----------------------------//

//----------------------------------------------------------------------------//
//                              Inicializa INT4                               // 
//----------------------------------------------------------------------------//
//  RA15 - pin 67
/*

    void inicializaINT4(void){
    INTCON2bits.INT4EP = 1;     //Polaridad del flanco - 1-Negativo/0-Positivo
    IEC3bits.INT4IE = 0;        //Interrupcion Habilitada - 1-Habilitada
    //IPC13bits.INT4IP = 7;       //Prioridad - 7-Alta/0-Baja
    IFS3bits.INT4IF = 0;        //Clear INT4 Interrupt Flag
}
 
 */
//------------------------  Fin inicializa INT4  -----------------------------//

//----------------------------------------------------------------------------//
//                           Inicializa PWM                                   // 
//----------------------------------------------------------------------------//
//      PIN  93 - PWM1L (RE0)    PIN 94 - PWM1H(RE1)
//      PIN  98 - PWM2L (RE2)    PIN 99 - PWM2H(RE3)
//      PIN 100 - PWM3L (RE4)    PIN  3 - PWM3H(RE5)
//      PIN   4 - PWM4L (RE6)    PIN  5 - PWM4H(RE7)
//


//extern bool bpolaridad_lazo_1, bpolaridad_lazo_2, bpolaridad_lazo_3;

/*
void PWM_Init( void ){
    PTCONbits.PTOPS = 1;    // PWM timer post-scale - Postcaler 1:2
    PTCONbits.PTCKPS = 0;   // PWM timer pre-scale _ TCY (prescaler 1:1)
    PTCONbits.PTMOD = 2;    // PWM operates in Up-down Mode continuously
 
    PTMR = 0;               // PWM counter value, start at 0
 
    PTPER = 2200;           // PWM Timebase period - frecuencia 10Khz
    
    //PWMCON1bits.PMOD4 = 1;  // PWM in complimentary mode = 0 - single mode = 1
    PWMCON1bits.PMOD3 = bpolaridad_lazo_3;  // PWM in complimentary mode = 0 - single mode = 1
    PWMCON1bits.PMOD2 = bpolaridad_lazo_2;  // PWM in complimentary mode = 0 - single mode = 1
    PWMCON1bits.PMOD1 = bpolaridad_lazo_1;  // PWM in complimentary mode = 0 - single mode = 1
    //PWMCON1bits.PEN4H = 1;  // PWM High pin is enabled
    //PWMCON1bits.PEN3H = 1;  // PWM High pin is enabled
    //PWMCON1bits.PEN2H = 1;  // PWM High pin is enabled
    //PWMCON1bits.PEN1H = 1;  // PWM High pin is enabled
    //PWMCON1bits.PEN4L = 1;  // PWM Low pin enabled (direction control later)
    PWMCON1bits.PEN3L = 1;  // PWM Low pin enabled (direction control later)
    PWMCON1bits.PEN2L = 1;  // PWM Low pin enabled (direction control later)
    PWMCON1bits.PEN1L = 1;  // PWM Low pin enabled (direction control later)
 
    //OVDCON = 0x00ff;
    
    //PWMCON2 = 0x0000;       // PWM update info
 
    DTCON1bits.DTAPS = 0;   //DeadTime pre-scaler
    DTCON1bits.DTA = 59;    //DeadTime value for 4 us. 
 
    //FLTACON = 0x0000;       // Fault A Control
 
    //OVDCON = 0x0000;        // Override control info
 
// Duty Cycle has a max value of 2xPeriod since output can change on rising or falling edge of Tcy
    PDC1 = 2200;            // PWM#1 Duty Cycle register (11-bit) - 50%
    PDC2 = 2200;            // PWM#2 Duty Cycle register (11-bit)
    PDC3 = 2200;            // PWM#3 Duty Cycle register (11-bit)
    //PDC4 = 2200;            // PWM#3 Duty Cycle register (11-bit)
 
    PTCONbits.PTEN = 1;     // Enable PWM Timerbase!
}
  
  
 */